try_out_Mar_10_19_40/app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(cart_params)
    @cart.save!
---
INSERT INTO "carts" ("item_id", "order_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["order_id", 1], ["created_at", 2017-03-09 18:20:36 UTC], ["updated_at", 2017-03-09 18:20:36 UTC], ["quantity", 23]]