try_out_Mar_10_19_40/app/controllers/clients_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."client_id" = ?  [["client_id", 1]]
---
  def index
    @grocers = Grocer.all
    @orders = Client.find(current_user.id).orders