try_out_Mar_10_19_40/app/controllers/grocers_controller.rb

  def index
    grocer = Grocer.find(current_user.id)
    @items = grocer.items
    @orders = grocer.orders
---
SELECT "items".* FROM "items" WHERE "items"."grocer_id" = ?  [["grocer_id", 3]]
SELECT "orders".* FROM "orders" WHERE "orders"."grocer_id" = ?  [["grocer_id", 3]]

    def set_order
      @order = Order.new(:grocer_id => @grocer.id, :client_id => current_user.id, :order_status_id => 1)
      @order.save!
---
INSERT INTO "orders" ("grocer_id", "client_id", "order_status_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["grocer_id", 3], ["client_id", 1], ["order_status_id", 1], ["created_at", 2017-03-09 18:20:19 UTC], ["updated_at", 2017-03-09 18:20:19 UTC]]