try_out_Mar_10_19_40/app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."grocer_id" = ?  [["grocer_id", 3]]
---
  def index
      @items = Item.where(:grocer_id => current_user.id)

INSERT INTO "items" ("name", "price_per_unit", "unit", "units_in_stock", "grocer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "trtr"], ["price_per_unit", 0.0], ["unit", "re"], ["units_in_stock", 8], ["grocer_id", 3], ["created_at", 2017-03-09 19:28:50 UTC], ["updated_at", 2017-03-09 19:28:50 UTC]]
---
  def create
    @item = Item.new(item_params)
    @item.grocer_id = current_user.id

    respond_to do |format|
      if @item.save

UPDATE "items" SET "units_in_stock" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["units_in_stock", 27], ["updated_at", 2017-03-09 18:19:34 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = ?  [["id", 5]]
---
  def destroy
    @item.destroy

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_item
      @item = Item.find(params[:id])