try_out_Mar_10_19_40/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."grocer_id" = ?  [["grocer_id", 3]]
SELECT "orders".* FROM "orders" WHERE "orders"."client_id" = ?  [["client_id", 1]]
---
  def index
    if (current_user.user_type == "Grocer")
      @orders = Order.where(:grocer_id => current_user.id)

    else
      @orders = Order.where(:client_id => current_user.id)

DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]
---
  def destroy
    @order.destroy

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_order
      @order = Order.find(params[:id])